test_config/cfe/ChartsOfCharacteristicTypes/AVS_МедиаФайлыТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<ChartOfCharacteristicTypes>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>AVS_МедиаФайлыТоваров</Name>
			<Type>
				<v8:Type>xs:string</v8:Type>
				<v8:StringQualifiers>
					<v8:Length>10</v8:Length>
				</v8:StringQualifiers>
			</Type>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>AVS_Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>AVS_ТипМедиа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.AVS_ТипыМедиа</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>AVS_URL</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>AVS_Сортировка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</ChartOfCharacteristicTypes>
</MetaDataObject>

test_config/cfe/ChartsOfCharacteristicTypes/AVS_МедиаФайлыТоваров/Ext/ObjectModule.bsl
&Перед("ПередЗаписью")
Процедура AVS_ПередЗаписью(Отказ)
	Если ОбменДанными.Загрузка Тогда Возврат; КонецЕсли;
	
	// 16.04.2026 { ПРАВКА: Детектор изменений медиа }
	Если Не ЭтоНовый() Тогда
		Реквизиты = "AVS_ТипМедиа, AVS_URL, AVS_Сортировка, ПометкаУдаления";
		Старые = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, Реквизиты);
		
		Изменено = (ЭтотОбъект.AVS_ТипМедиа    <> Старые.AVS_ТипМедиа)
		        Или (ЭтотОбъект.AVS_URL         <> Старые.AVS_URL)
		        Или (ЭтотОбъект.AVS_Сортировка   <> Старые.AVS_Сортировка)
		        Или (ЭтотОбъект.ПометкаУдаления <> Старые.ПометкаУдаления);
				
		ДополнительныеСвойства.Вставить("AVS_МедиаИзменено", Изменено);
	Иначе
		ДополнительныеСвойства.Вставить("AVS_МедиаИзменено", Истина);
	КонецЕсли;
	
	// Только внутренняя логика объекта
	ВалидацияДанныхМедиа(Отказ); 
	Если Не Отказ Тогда
		УстановитьАвтоматическуюСортировку();
	КонецЕсли;
КонецПроцедуры  

&Перед("ПередУдалением")
Процедура AVS_ПередУдалением(Отказ)
	
	Если ОбменДанными.Загрузка Тогда Возврат; КонецЕсли;
	
	// Регистрация изменения для товара-владельца при физическом удалении записи
	Если ЗначениеЗаполнено(ЭтотОбъект.AVS_Номенклатура) Тогда
		AVS_ОбщийМодульСайт.AVS_ЗарегистрироватьИзменение(ЭтотОбъект.AVS_Номенклатура, "MEDIA_CHANGE");
	КонецЕсли;
	
КонецПроцедуры

#Область СлужебныйПрограммныйИнтерфейс

// Проверка корректности заполнения полей (п. 2.1 ТЗ)
Процедура ВалидацияДанныхМедиа(Отказ)
	
	Попытка
		// Обращаемся через ЭтотОбъект
		Если Не ЗначениеЗаполнено(ЭтотОбъект.AVS_Номенклатура) Тогда
			ОбщегоНазначения.СообщитьПользователю("Не выбрана номенклатура!", , "AVS_Номенклатура");
			Отказ = Истина;
		КонецЕсли;

		Если ПустаяСтрока(ЭтотОбъект.AVS_URL) Тогда
			ОбщегоНазначения.СообщитьПользователю("URL обязателен!", , "AVS_URL");
			Отказ = Истина;
		Иначе
			// Проверка формата (http/https)
			ТекстURL = СокрЛП(НРег(ЭтотОбъект.AVS_URL));
			Если Не (СтрНачинаетсяС(ТекстURL, "http://") Или СтрНачинаетсяС(ТекстURL, "https://")) Тогда
				ОбщегоНазначения.СообщитьПользователю("URL должен начинаться с http:// или https://", , "AVS_URL");
				Отказ = Истина;
			КонецЕсли;
			
			// 2. ПРОВЕРКА УНИКАЛЬНОСТИ (п. 2.1 ТЗ)
			Если Не Отказ Тогда
				Запрос = Новый Запрос;
				Запрос.Текст = 
					"ВЫБРАТЬ ПЕРВЫЕ 1
					|	Медиа.Ссылка КАК Ссылка
					|ИЗ
					|	ПланВидовХарактеристик.AVS_МедиаФайлыТоваров КАК Медиа
					|ГДЕ
					|	Медиа.AVS_Номенклатура = &Номенклатура
					|	И Медиа.AVS_URL = &URL
					|	И Медиа.Ссылка <> &ТекущаяСсылка
					|	И НЕ Медиа.ПометкаУдаления"; // Проверяем только среди активных
				
				Запрос.УстановитьПараметр("Номенклатура",  ЭтотОбъект.AVS_Номенклатура);
				Запрос.УстановитьПараметр("URL",           ЭтотОбъект.AVS_URL);
				Запрос.УстановитьПараметр("ТекущаяСсылка", ЭтотОбъект.Ссылка);
				
				Результат = Запрос.Выполнить();
				Если Не Результат.Пустой() Тогда
					ТекстОшибки = СтрШаблон("Данный URL уже используется для этого товара (Номенклатура: %1)", ЭтотОбъект.AVS_Номенклатура);
					ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, , "AVS_URL");
					Отказ = Истина;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
	Исключение
		ЗаписатьВЖурнал("Ошибка валидации: " + ИнформацияОбОшибке().Описание, УровеньЖурналаРегистрации.Ошибка);
		Отказ = Истина;
	КонецПопытки;
	
КонецПроцедуры

// Автоматическое определение порядка отображения (п. 2.2 ТЗ)
Процедура УстановитьАвтоматическуюСортировку()
	
	// Если пользователь уже задал сортировку вручную, не пересчитываем
	Если ЭтотОбъект.AVS_Сортировка > 0 Тогда
		Возврат;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ МАКС(Медиа.AVS_Сортировка) КАК МаксСорт
		|ИЗ ПланВидовХарактеристик.AVS_МедиаФайлыТоваров КАК Медиа
		|ГДЕ Медиа.AVS_Номенклатура = &Номенклатура";
	
	Запрос.УстановитьПараметр("Номенклатура", ЭтотОбъект.AVS_Номенклатура);
	
	Попытка
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() И Выборка.МаксСорт <> NULL Тогда
			ЭтотОбъект.AVS_Сортировка = Выборка.МаксСорт + 10;
		Иначе
			ЭтотОбъект.AVS_Сортировка = 10;
		КонецЕсли;
	Исключение
		ЭтотОбъект.AVS_Сортировка = 10;
	КонецПопытки;
	
КонецПроцедуры

// Вспомогательная процедура логирования
Процедура ЗаписатьВЖурнал(Текст, Уровень)
	ЗаписьЖурналаРегистрации("AVS_Медиа.Объект", Уровень, , , Текст);
КонецПроцедуры

#КонецОбласти
